In [4]:
# 3.
## Import libraries

import pandas as pd
import numpy as np
import os

In [5]:
## Import

path = '/Users/liamanderson/Desktop/Instacart Basket Analysis'

In [6]:
df_cust = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

In [7]:
# 4. 
## Wrangle data

df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [8]:
## Rename columns

df_cust.rename(columns = {'STATE' : 'State' , 'fam_status' : 'marital_status', 'Surnam' : 'Surname'}, inplace = True)

In [9]:
df_cust.head()

,user_id,First Name,Surname,Gender,State,Age,date_joined,n_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [10]:
## Check shape

df_cust.shape

(206209, 10)

In [11]:
# Check some of the statistics of the data frame

df_cust.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [12]:
# 5.
## Check for missing values

df_cust.isnull().sum()

user_id               0
First Name        11259
Surname               0
Gender                0
State                 0
Age                   0
date_joined           0
n_dependants          0
marital_status        0
income                0
dtype: int64

In [13]:
df_nan = df_cust[df_cust['First Name'].isnull() == True]

In [14]:
df_nan

,user_id,First Name,Surname,Gender,State,Age,date_joined,n_dependants,marital_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222

In [15]:
## Leave the missing values there because even if there isnt a first name there is still a last name for every customer

In [16]:
## check for duplicates

df_dups = df_cust[df_cust.duplicated()]

In [17]:
df_dups

Empty DataFrame
Columns: [user_id, First Name, Surname, Gender, State, Age, date_joined, n_dependants, marital_status, income]
Index: []

In [18]:
## There are no duplicates

In [19]:
## Check data types

df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   user_id         206209 non-null  int64
 1   First Name      194950 non-null  object
 2   Surname         206209 non-null  object
 3   Gender          206209 non-null  object
 4   State           206209 non-null  object
 5   Age             206209 non-null  int64
 6   date_joined     206209 non-null  object
 7   n_dependants    206209 non-null  int64
 8   marital_status  206209 non-null  object
 9   income          206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [20]:
## Check for mixed data

for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

First Name

/var/folders/f5/4n0d4d_s69sg2_b5f8nxqp200000gn/T/ipykernel_48553/1694583949.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
/var/folders/f5/4n0d4d_s69sg2_b5f8nxqp200000gn/T/ipykernel_48553/1694583949.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
/var/folders/f5/4n0d4d_s69sg2_b5f8nxqp200000gn/T/ipykernel_48553/1694583949.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
/var/folders/f5/4n0d4d_s69sg2_b5f8nxqp200000gn/T/ipykernel_48553/1694583949.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
/var/folders/f5/4n0d4d_s69sg2_b5f8nxqp200000gn/T/ipykernel_48553/1694583949.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
/var/folders/f5/4n0d4d_s69sg2_b5f8nxqp200000gn/T/ipykernel_48553/1694583949.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
/var/folders/f5/4n0d4d_s69sg2_b5f8nxqp200000gn/T/ipykernel_48553/1694583949.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
/var/folders/f5/4n0d4d_s69sg2_b5f8nxqp200000gn/T/ipykernel_48553/1694583949.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
/var/folders/f5/4n0d4d_s69sg2_b5f8nxqp200000gn/T/ipykernel_48553/1694583949.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
/var/folders/f5/4n0d4d_s69sg2_b5f8nxqp200000gn/T/ipykernel_48553/1694583949.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)

In [21]:
## Only the first name is considered mixed because there are missing values so we can leave it as it is

In [22]:
# 6. 
## Import data set

ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_merge_group_agg.pkl'))

In [23]:
## Check if there are columns that match and check both data frames shape

df_cust.head()

,user_id,First Name,Surname,Gender,State,Age,date_joined,n_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [24]:
ords_prods_merge.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,mean_spending_price,spending_flag,median_days_since_prior_order,order_frequency_flag
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,Mid-range product,Regularly busy,Regularly busy,Most orders,32,Regular customer,6.935811,Low spender,8.0,Frequent customer
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,Mid-range product,Regularly busy,Regularly busy,Average orders,32,Regular customer,6.935811,Low spender,8.0,Frequent customer
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,21,...,Mid-range product,Busiest day,Busiest days,Average orders,5,New customer,7.930208,Low spender,8.0,Frequent customer
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,13,...,Mid-range product,Regularly busy,Slowest days,Most orders,3,New customer,4.972414,Low spender,9.0,Frequent customer
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,17,...,Mid-range product,Least busy,Slowest days,Average orders,3,New customer,4.972414,Low spender,9.0,Frequent customer

In [25]:
df_cust.shape

(206209, 10)

In [26]:
ords_prods_merge.shape

(32404859, 24)

In [27]:
## User id is in both data frames
## Check to make sure they are the same data type

df_cust.dtypes['user_id']

dtype('int64')

In [28]:
ords_prods_merge.dtypes['user_id']

dtype('int64')

In [29]:
## Change both to string so because no calculations need to be done on user id

df_cust['user_id'] = df_cust['user_id'].astype('str')

In [30]:
ords_prods_merge['user_id'] = ords_prods_merge['user_id'].astype('str')

In [31]:
## Check to make sure they are both string

df_cust.dtypes['user_id']

dtype('O')

In [32]:
ords_prods_merge.dtypes['user_id']

dtype('O')

In [33]:
## Delete the old _merge column

print(ords_prods_merge.columns)

Index(['product_id', 'product_name', 'aisle_id', 'department_id', 'prices',
       'order_id', 'user_id', 'order_number', 'orders_day_of_week',
       'order_hour_of_day', 'days_since_prior_order', 'add_to_cart_order',
       'reordered', '_merge', 'price_range_loc', 'busiest_day', 'busiest_days',
       'busiest_period_of_day', 'max_order', 'loyalty_flag',
       'mean_spending_price', 'spending_flag', 'median_days_since_prior_order',
       'order_frequency_flag'],
      dtype='object')

In [34]:
ords_prods_merge = ords_prods_merge.drop(columns=['_merge'])

In [35]:
print(ords_prods_merge.columns)

Index(['product_id', 'product_name', 'aisle_id', 'department_id', 'prices',
       'order_id', 'user_id', 'order_number', 'orders_day_of_week',
       'order_hour_of_day', 'days_since_prior_order', 'add_to_cart_order',
       'reordered', 'price_range_loc', 'busiest_day', 'busiest_days',
       'busiest_period_of_day', 'max_order', 'loyalty_flag',
       'mean_spending_price', 'spending_flag', 'median_days_since_prior_order',
       'order_frequency_flag'],
      dtype='object')

In [36]:
## data frame is to large to be able to merge the two so we will get rid of some columns to make it possible

ords_prods_merge = ords_prods_merge.drop(['max_order', 'mean_spending_price', 'median_days_since_prior_order'], axis=1)

In [37]:
## export data so we can create a new workbook to merge the data sets

ords_prods_merge.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'ords_prods_merge.pkl'))

In [38]:
df_cust.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'cleaned_df_cust.pkl'))